# 1. Вычислить число Пи с заданной точностью d
# import math
# from decimal import Decimal
# P = math.pi
# number = input(Decimal(P))
# for i in Decimal(P):
# весь день голову ломаю, не получается решить, даже библиотеку подключаю в помощь..жду разбора этой задачи

# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N
# N = int(input())
# for i in range(1, N):
#     if N % i == 0 and i < 10:
#         print()  
#         print(i)


# 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности

# som_list = input().split()
# for i in som_list:
#     if som_list.count(i) == 1:
#         print(i)

